# Step by Step: Wrangling and Tidying Data from SQLite Tables

This notebook demonstrates a systematic approach to wrangle and tidy data from SQLite tables using pandas.

## 1. Load Data from SQLite Tables

Use `pandas.read_sql_query` to load the tables (`students`, `courses`, `student_jobs`) from the SQLite database into DataFrames.

In [1]:
import sqlite3
import pandas as pd

# Connect to the SQLite database
con = sqlite3.connect("cademycode.db")

# Load tables into DataFrames
students = pd.read_sql_query("SELECT * FROM cademycode_students", con)
courses = pd.read_sql_query("SELECT * FROM cademycode_courses", con)
student_jobs = pd.read_sql_query("SELECT * FROM cademycode_student_jobs", con)

## 2. Inspect DataFrames

Use `.head()`, `.info()`, and `.describe()` to get an overview of the data and identify potential issues.

In [2]:
# Inspect students DataFrame
print(students.head())
print(students.info())
print(students.describe(include='all'))

# Inspect courses DataFrame
print(courses.head())
print(courses.info())
print(courses.describe(include='all'))

# Inspect student_jobs DataFrame
print(student_jobs.head())
print(student_jobs.info())
print(student_jobs.describe(include='all'))

   uuid             name         dob sex  \
0     1  Annabelle Avery  1943-07-03   F
1     2      Micah Rubio  1991-02-07   M
2     3       Hosea Dale  1989-12-07   M
3     4     Mariann Kirk  1988-07-31   F
4     5  Lucio Alexander  1963-08-31   M

                                        contact_info job_id num_course_taken  \
0  {"mailing_address": "303 N Timber Key, Irondal...    7.0              6.0
1  {"mailing_address": "767 Crescent Fair, Shoals...    7.0              5.0
2  {"mailing_address": "P.O. Box 41269, St. Bonav...    7.0              8.0
3  {"mailing_address": "517 SE Wintergreen Isle, ...    6.0              7.0
4  {"mailing_address": "18 Cinder Cliff, Doyles b...    7.0             14.0

  current_career_path_id time_spent_hrs
0                    1.0           4.99
1                    8.0            4.4
2                    8.0           6.74
3                    9.0          12.31
4                    3.0           5.64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    5000 non-null   int64
 1   name                    5000 non-null   object
 2   dob                     5000 non-null   object
 3   sex                     5000 non-null   object
 4   contact_info            5000 non-null   object
 5   job_id                  4995 non-null   object
 6   num_course_taken        4749 non-null   object
 7   current_career_path_id  4529 non-null   object
 8   time_spent_hrs          4529 non-null   object
dtypes: int64(1), object(8)
memory usage: 351.7+ KB
None
               uuid           name         dob   sex  \
count   5000.000000           5000        5000  5000
unique          NaN           4998        4492     3
top             NaN  Robbie Davies  1993-08-03     M
freq            NaN              2           4  1995
mean    2500.500000            NaN         NaN   NaN
std     1443.520003            NaN         NaN   NaN
min        1.000000            NaN         NaN   NaN
25%     1250.750000            NaN         NaN   NaN
50%     2500.500000            NaN         NaN   NaN
75%     3750.250000            NaN         NaN   NaN
max     5000.000000            NaN         NaN   NaN

                                             contact_info job_id  \
count                                                5000   4995
unique                                               5000      8
top     {"mailing_address": "303 N Timber Key, Irondal...    2.0
freq                                                    1    706
mean                                                  NaN    NaN
std                                                   NaN    NaN
min                                                   NaN    NaN
25%                                                   NaN    NaN
50%                                                   NaN    NaN
75%                                                   NaN    NaN
max                                                   NaN    NaN

       num_course_taken current_career_path_id time_spent_hrs
count              4749                   4529           4529
unique               16                     10           2192
top                 5.0                    5.0          17.47
freq                341                    476              8
mean                NaN                    NaN            NaN
std                 NaN                    NaN            NaN
min                 NaN                    NaN            NaN
25%                 NaN                    NaN            NaN
50%                 NaN                    NaN            NaN
75%                 NaN                    NaN            NaN
max                 NaN                    NaN            NaN
   career_path_id      career_path_name  hours_to_complete
0               1        data scientist                 20
1               2         data engineer                 20
2               3          data analyst                 12
3               4  software engineering                 25
4               5      backend engineer                 18
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   career_path_id     10 non-null     int64
 1   career_path_name   10 non-null     object
 2   hours_to_complete  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes
None
        career_path_id career_path_name  hours_to_complete
count         10.00000               10          10.000000
unique             NaN               10                NaN
top                NaN   data scientist                NaN
freq               NaN                1                NaN
mean           5.50000              NaN          21.900000
std            3.02765              NaN           6.707376
min            1.00000              NaN          12.000000
25%            3.25000              NaN          18.500000
50%            5.50000              NaN          20.000000
75%            7.75000              NaN          26.500000
max           10.00000              NaN          35.000000
   job_id        job_category  avg_salary
0       1           analytics       86000
1       2            engineer      101000
2       3  software developer      110000
3       4            creative       66000
4       5  financial services      135000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   job_id        13 non-null     int64
 1   job_category  13 non-null     object
 2   avg_salary    13 non-null     int64
dtypes: int64(2), object(1)
memory usage: 444.0+ bytes
None
           job_id job_category     avg_salary
count   13.000000           13      13.000000
unique        NaN           10            NaN
top           NaN     creative            NaN
freq          NaN            2            NaN
mean     4.384615          NaN   89230.769231
std      2.662657          NaN   34727.879881
min      0.000000          NaN   10000.000000
25%      3.000000          NaN   66000.000000
50%      4.000000          NaN   86000.000000
75%      6.000000          NaN  110000.000000
max      9.000000          NaN  135000.000000

## 3. Check Data Types

Use `.dtypes` to review column data types and ensure they match expected formats.

In [3]:
print("Students Data Types:")
print(students.dtypes)

print("\nCourses Data Types:")
print(courses.dtypes)

print("\nStudent Jobs Data Types:")
print(student_jobs.dtypes)

Students Data Types:
uuid                       int64
name                      object
dob                       object
sex                       object
contact_info              object
job_id                    object
num_course_taken          object
current_career_path_id    object
time_spent_hrs            object
dtype: object

Courses Data Types:
career_path_id        int64
career_path_name     object
hours_to_complete     int64
dtype: object

Student Jobs Data Types:
job_id           int64
job_category    object
avg_salary       int64
dtype: object

## 4. Remove Duplicate Rows

Use `.drop_duplicates(inplace=True)` to remove duplicate entries from each DataFrame.

In [4]:
students.drop_duplicates(inplace=True)
courses.drop_duplicates(inplace=True)
student_jobs.drop_duplicates(inplace=True)

## 5. Handle Missing Values

Use `.isna().sum()` to identify missing values and decide on strategies (drop, fill, or impute) for handling them.

In [5]:
print("Missing values in students:")
print(students.isna().sum())

print("\nMissing values in courses:")
print(courses.isna().sum())

print("\nMissing values in student_jobs:")
print(student_jobs.isna().sum())

# Example: Drop rows with missing values (customize as needed)
students.dropna(inplace=True)
courses.fillna("Unknown", inplace=True)
student_jobs.fillna(0, inplace=True)

Missing values in students:
uuid                        0
name                        0
dob                         0
sex                         0
contact_info                0
job_id                      5
num_course_taken          251
current_career_path_id    471
time_spent_hrs            471
dtype: int64

Missing values in courses:
career_path_id       0
career_path_name     0
hours_to_complete    0
dtype: int64

Missing values in student_jobs:
job_id          0
job_category    0
avg_salary      0
dtype: int64

## 6. Standardize Column Names

Rename columns to follow a consistent naming convention using `.rename()` or by assigning to `.columns`.

In [6]:
# Example: Convert all column names to lowercase and replace spaces with underscores
students.columns = [col.lower().replace(" ", "_") for col in students.columns]
courses.columns = [col.lower().replace(" ", "_") for col in courses.columns]
student_jobs.columns = [col.lower().replace(" ", "_") for col in student_jobs.columns]

## 7. Convert Data Types if Necessary

Use `.astype()` to convert columns to appropriate data types (e.g., dates, categories, integers).

In [7]:
# Example: Convert 'enrollment_date' in students to datetime
if 'enrollment_date' in students.columns:
    students['enrollment_date'] = pd.to_datetime(students['enrollment_date'], errors='coerce')

# Example: Convert 'course_id' in courses to category
if 'course_id' in courses.columns:
    courses['course_id'] = courses['course_id'].astype('category')

## 8. Reshape Data (if needed)

Use pandas functions like `.melt()`, `.pivot()`, or `.stack()` to reshape data for analysis.

In [8]:
# Example: Pivot student_jobs to see job counts per student
if 'student_id' in student_jobs.columns and 'job_title' in student_jobs.columns:
    job_counts = student_jobs.pivot_table(index='student_id', columns='job_title', aggfunc='size', fill_value=0)
    print(job_counts.head())

## 9. Merge DataFrames

Use `pandas.merge()` to combine DataFrames based on common keys for integrated analysis.

In [9]:
# Example: Merge students with student_jobs on 'student_id'
if 'student_id' in students.columns and 'student_id' in student_jobs.columns:
    students_jobs_merged = pd.merge(students, student_jobs, on='student_id', how='left')

# Example: Merge with courses if relevant key exists
if 'course_id' in students.columns and 'course_id' in courses.columns:
    full_data = pd.merge(students_jobs_merged, courses, on='course_id', how='left')

## 10. Save Cleaned Data

Export the cleaned and tidied DataFrames to CSV or other formats using `.to_csv()`.

In [10]:
students.to_csv("cleaned_students.csv", index=False)
courses.to_csv("cleaned_courses.csv", index=False)
student_jobs.to_csv("cleaned_student_jobs.csv", index=False)

# Save merged DataFrame if created
if 'full_data' in locals():
    full_data.to_csv("cleaned_full_data.csv", index=False)